// --------------------------------------------------------------------------------------------------------------
// Створити функцію конструктор для об'єктів User з полями id, name, surname , email, phone
// створити пустий масив, наповнити його 10 об'єктами new User(....)

function User(id, name, surname, email, phone) {
    this.id = id;
    this.name = name;
    this.surname = surname;
    this.email = email;
    this.phone = phone;
};
let users = [];
for (i = 1; i <= 10; i++) {
    users.push(new User(i, 'Andrii', 'Kovalyc', 'kovalic1036@gmail.com', 80636987804))
}
console.log(users);
console.log('---------------------------------------')
    // ---------------------------------------------------------------------------------------------------------

// - Взяти масив з  User[] з попереднього завдання, та відфільтрувати , залишивши тільки об'єкти з парними id (filter);

let filteredUsers = users.filter(user => user.id % 2 === 0 && user.id !== 0);
console.log(filteredUsers);
console.log("---------------------------------------------");
// --------------------------------------------------------------------------------------------------------

// - Взяти масив з  User[] з попереднього завдання, та відсортувати його по id. по зростанню (sort)

// я роблю сорт по зменшенню значення id

users.sort((a, b) => b.id - a.id);
console.log(users)
console.log("--------------------------------------------------------");
// ----------------------------------------------------------------------------------------------------

// - створити класс для об'єктів Client з полями id, name, surname , email, phone, order (поле є масивом зі списком товарів)
// створити пустий масив, наповнити його 10 об'єктами Client

class Client {
    constructor(id, name, surname, email, phone, ...order) {
        this.id = id;
        this.name = name;
        this.surname = surname;
        this.email = email;
        this.phone = phone;
        this.order = order
    };
};
let clients = [];
for (i = 1; i <= 10; i++) {
    clients.push(new Client(i, 'Andrii', 'Kovalyk', 'kovalic1036@gmail.com', 80636987804, 'book', 'phone', 'pen', 'magazine'));
    clients[i - 1].order[i] = 'some new stuff' // додав лише для того щоб зробити різну довжину масивів.
};
console.log(clients);
console.log('----------------------------------------------------');
// ---------------------------------------------------------------------------------------

// - Взяти масив (Client [] з попереднього завдання).Відсортувати його по кількості товарів в 
// полі order по зростанню. (sort)
// 
// я роблю сорт по зменшенню order, так як початковий масив clients вже "відсортований" по збільшенню

clients.sort((a, b) => b.order.length - a.order.length);
console.log(clients);
console.log('----------------------------------------------------------------------');
// ------------------------------------------------------------------------------------------------